team/case2/team_case_2_40000_curved/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 -6 0)
    (75 -2 0)
    (75 2 0)
    (0 6 0)
    (0 -6 .1)
    (75 -2 .1)
    (75 2 .1)
    (0 6 .1)  
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
  arc 0 1 (37.5 -2.9978697 0)
  arc 3 2 (37.5 2.9978697 0)
  arc 7 6 (37.5 2.9978697 .1)
  arc 4 5 (37.5 -2.9978697 .1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (2 6 5 1)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
